In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

# 1. Group 1 cột và tính

In [3]:
df.groupby('Company').sum()

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

# 2. Lấy 1 khối bất kì trong khối đã ra

In [8]:
df.groupby('Company').sum().loc['FB']

Person    CarlSarah
Sales           593
Name: FB, dtype: object

# 3. Hàm tính toán các số cơ bản trong thống kê

In [ ]:
df.groupby('Group').describe()

      Value                                                                  \
      count          mean           std    min       25%      50%       75%
Group
1       3.0   2613.666667   4123.197950  123.0    234.00    345.0   3859.00
2       2.0  41952.500000  59298.681777   22.0  20987.25  41952.5  62917.75
3       1.0    111.000000           NaN  111.0    111.00    111.0    111.00


           max
Group
1       7373.0
2      83883.0
3        111.0

In [ ]:
df.groupby('Group').describe().transpose()

Group                  1             2      3
Value count     3.000000      2.000000    1.0
      mean   2613.666667  41952.500000  111.0
      std    4123.197950  59298.681777    NaN
      min     123.000000     22.000000  111.0
      25%     234.000000  20987.250000  111.0
      50%     345.000000  41952.500000  111.0
      75%    3859.000000  62917.750000  111.0
      max    7373.000000  83883.000000  111.0